"use strict";

 //alert('Hello'); /*вызывает окошко уведомления о чём-то важном в браузере*/

// const result = confirm('Are you here?');
// console.log(result);

// const answer = +prompt("Вам есть 18?", "18");
// console.log(answer + 5);     /*ВАЖНО! вся информация которая приходит от пользователя, получается в виде строк, в независимости от того, как мы её получили*/ 
/*тип данных можно преоброзовывать в другой при поиощи некоторых операций*/

const answers = [];

// answers[0] = prompt('Как ваше имя?', '');
// answers[1] = prompt('Как ваше фамилия?', '');
// answers[2] = prompt('Сколько вам лет?', '');

console.log(typeof(answers));     /*оператора "typeof" указывает тип данных в консоле браузера. Напр: число, строка тд*/


